// ასე იწერება კომენტარი ჯს-ში
/*
ასე იწერება მრავალწერტილი კომენტარი ჯს-ში
*/

//document.write("hello world")// ეს არის ჯს-ის მეთოდი რომელიც გვაძლევს საშუალებას ვწეროთ html-ში მაგრამ არ ვიყენებთ
//console.log("hello world")// ეს არის მეთოდი რომელიც გვაძლევს საშუალებას ვწეროთ კონსოლში და ვხედავთ თუ როგორ მუშაობს ჩვენი კოდი
//console.info("hello world")// ესეც იგივეა როგორც console.log
//console.error("hello world")// ესეც იგივეა როგორც console.log მაგრამ ეს არის შეცდომის შემთხვევაში
//console.warn("hello world")// ესეც იგივეა როგორც console.error მაგრამ ეს არის გაფრთხილება

//მთავარი ნაწილი

//ცვლადები
console.log("ცვლადები");

//var არის ცვლადის შექმნა
var num;
num = 5; // ეს არის ცვლადის მნიშვნელობის მინიჭება
num = 10; // ეს არის ცვლადის მნიშვნელობის შეცვლა
var number = 5.5; // ეს არის ცვლადის შექმნა და მნიშვნელობის მინიჭება ერთ ხაზში
var name = "hello world";
var bool = true; // ეს არის ბულევი ცვლადი რომელიც შეიძლება იყოს true ან false
bool = "hi";
console.log("variable: " + num); // ეს არის მეთოდი რომელიც გვაძლევს საშუალებას ვწეროთ კონსოლში და ვხედავთ თუ როგორ მუშაობს ჩვენი კოდი

const num2 = 5; // ეს არის ცვლადის შექმნა და მნიშვნელობის მინიჭება ერთ ხაზში მაგრამ ეს არის მუდმივი ცვლადი და მისი მნიშვნელობა არ იცვლება
console.log("variable: " + num2);

console.log(" ");
//მატემატიკური ოპერაციები
console.log("მათემატიკური ოპერაციები");

var num1 = 5;
var num3 = 10;

//ვარიანტი 1
console.log("ვარიანტი 1");

var res = num1 - num3; // ეს არის მათემატიკური ოპერაცია რომელიც გვაძლევს შედეგს

console.log("sum: " + res); // ეს არის მეთოდი რომელიც გვაძლევს საშუალებას ვწეროთ კონსოლში და ვხედავთ თუ როგორ მუშაობს ჩვენი კოდი

//ვარიანტი 2
console.log("ვარიანტი 2");

console.log("sum: " + (num1 - num3));
console.log("sum: " + (num1 + num3));
console.log("sum: " + num1 * num3);
console.log("sum: " + num1 / num3);
console.log("sum: " + (num1 % num3));

//ვარიანტი 3
console.log("ვარიანტი 3");

var num4 = 5;
num4 += 5; // ეს არის მათემატიკური ოპერაცია რომელიც გვაძლევს შედეგს

//ვარიანტი 4
console.log("ვარიანტი 4");

var num5 = 5;
num5++; // ეს არის მათემატიკური ოპერაცია რომელიც გვაძლევს შედეგს და უმატებს 1

var str = Number("5"); // ეს არის სტრინგი რომელიც უნდა გადაიყვანოს ნომერში ანუ integer-ში
var str2 = Number("10");
var num6 = 5;

console.log("sum: " + (str + str2 + num6)); // ეს არის მათემატიკური ოპერაცია რომელიც გვაძლევს შედეგს და აერთიანებს სტრინგებს ანუ კომკატინაცია

Math.log("math: " + Math.PI); // პოულობს პი-ს მნიშვნელობას
console.log("math: " + Math.min(4, 5, 6, 4, 36, 36, 2, 7, 1, 7, 4, 0)); // პოულობს უმწირეს მნიშვნელობას
console.log("math: " + Math.max(4, 5, 6, 4, 36, 36, 2, 7, 1, 7, 4, 0)); // პოულობს უმაღლეს მნიშვნელობას

console.log(" ");
// პირობითი ოპერაციები
console.log("პირობითი ოპერაციებ");

var num7 = 5;
var ishashous = true;

if (num7 > 5) {
  // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
  console.log("true"); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
} 
else if (num7 == 5) {
  // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
  console.log(5); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
} else {
  console.log("false"); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა არ შესრულდა
}

console.log(" ");
// or == ||
// and == &&
console.log("or = ||  and = &&");

// ishashous = true იგივე რაც ishashous

if (num7 > 5 || ishashous == true) {
  // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
  console.log("true"); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
}

if (num7 == 5 && ishashous == true) {
  // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
  console.log(5); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
}

console.log(" ");

//switch - case

console.log("switch - case");
var num8 = 5;

switch (num8) {
  case 5: // იგივე if. არ შეიძლება მათემატიკური ოპერაცია იყოს
    console.log("5"); // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
    break; // ეს არის პირობითი ოპერაცია რომელიც გვაძლევს შედეგს თუ პირობა შესრულდა
  case 6:
    console.log("6");
    break;
  case 7:
    console.log("7");
    break;
  default: // იგივე else
    console.log("default");
    break; // ეს არ არის აუცილებელი
}

console.log(" ");

// მონაცემთა ნაკრები

console.log("მონაცემთა ნაკრები");

var arr = [1, 2, 3, 4, 5, "str", true]; // ეს არის მასივი რომელიც შეიცავს მონაცემებს list-ის სახით
arr[2] = 10; // ეს არის მასივი რომელიც შეიცავს მონაცემებს list-ის სახით და შეცვლის მასივის მნიშვნელობას
console.log(arr); //გამოიტანს მაისივის მნიშვნელობებს
console.log(arr.length); // ითვლის მასივის სიგრძეს

//ინდექსაცია

console.log(arr[0]); // 1
console.log(arr[6]); // 2

//მრავალგანზომილებიანი მასივები

var arr2 = [
  [1, 2, 3],
  [4, 5, 6],
  [7, 8, 9],
]; // ეს არის მრავალგანზომილებიანი მასივი რომელიც შეიცავს მონაცემებს list-ის სახით
arr2[2][0] = 10; // ეს არის მრავალგანზომილებიანი მასივი რომელიც შეიცავს მონაცემებს list-ის სახით და შეცვლის მასივის მნიშვნელობას
console.log(arr2[0][1]);

console.log(" ");

//ციკლები
//არის 3 ტიპის ციკლი for, while, Do while

console.log("ციკლები");

// for

console.log("for");

for (var i = 0; i < 10; i++) {
  //პირველი მიშვლენობა შექვმენით ცვლადი და მივანიჟეთ მნიშვლელობა. მიშვნელობა არ შეიძლება იყოს str ან bool. მეორე მიშვნელობა სამენ ეს მიშვნელობა იქნება true მაქამდე იმუშავებს ციკლი. მესამე მიშვნელობა როგორ უნდა შეიცვალოს i
  console.log(i);
}

console.log(" ");

// while

console.log("while");

//ვაილში ჯერ უნდა შევქმენთ ცვლადი შემდეგ უნდა ეს ცვლადი გამოვიყენოთ თვითონ while ციკლში და while ციკლში მხოლოდ პირობას ვაძლევთ და თვითონ ციკლში ვწერთ როგორ შეიცვლება ცვლადი

var j = 1000;

while (j >= 100) {
  console.log(j);
  j -= 100;
}

//var ishashous = true
// while(ishashous){//უსასრულო ციკლი

// }

console.log(" ");

// Do while

console.log("Do while");

//იგივე while ციკლი მაგრამ თუ შემოწმება არასწორად დავწერეთ 1 იტერაციას მაინც მოახდენს~

var x = 100;

do {
  console.log(x);
} while (x < 50);

console.log(" ");

var y = 0;
do {//აქ იწერება რას გააკეთებს ეს ციკლი
  console.log(y);
  y++;
} while (y < 10);

console.log(" ");

// ციკლების ოპერატორები

console.log("ციკლების ოპერატორები");

console.log("პირველი ოპერატორი(break)");

for (var i = 10; i <= 20; i += 2) {
  if (i > 15) {
    break; //ციკლიდან გამოსვლა
  }
  console.log(i);
}

console.log(" ");

console.log("მეორე ოპერატორი(continue)");

for (var i = 10; i <= 20; i++) {
  if (i % 2 == 0) {
    continue; //რამე იტერაციის გამოტოვება
  }
  console.log(i);
}

// ციკლები და მასივები(list)

console.log(" ");

console.log("ციკლები და მასივები(list)");

var arr = [54, 123, 63, 134, "hi", true, 45, 34, 62, "hello world"];

for (i = 0; i < arr.length; i++) {
  console.log("element: " + (i + 1) + ": " + arr[i]);
}
